src/srm_client/templates/Cancel.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:srm0">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:Cancel>
         <urn:_this type="SrmRecoveryPlan">{{ moref }}</urn:_this>
      </urn:Cancel>
   </soapenv:Body>
</soapenv:Envelope>